ART-Badge/SDK/libraries/inc/peripheral/rtl876x_ir.h
#define IS_IR_INT_CLEAR(INT)            (((INT) == IR_INT_TF_EMPTY_CLR)  || ((INT) == IR_INT_TF_LEVEL_CLR)  || \
                                         ((INT) == IR_INT_TF_OF_CLR)      || ((INT) == IR_INT_RF_FULL_CLR)   || \
                                         ((INT) == IR_INT_RF_LEVEL_CLR)   || ((INT) == IR_INT_RX_CNT_OF_CLR) || \
                                         ((INT) == IR_INT_RF_OF_CLR)      || ((INT) == IR_INT_RX_CNT_THR_CLR)|| \
                                         ((INT) == IR_INT_RF_ERROR_CLR))

/**
 * \defgroup    IR_Flag IR Flag
 * \{
 * \ingroup     IR_Exported_Constants
 */
#define IR_FLAG_TF_EMPTY                                    ((uint32_t)IR_TX_FIFO_EMPTY_Msk)
#define IR_FLAG_TF_FULL                                     ((uint32_t)IR_TX_FIFO_FULL_Msk)
#define IR_FLAG_TX_RUN                                      ((uint32_t)IR_TX_STATUS_Msk)
#define IR_FLAG_RF_EMPTY                                    ((uint32_t)IR_RX_FIFO_EMPTY_Msk)
#define IR_FLAG_RX_RUN                                      ((uint32_t)IR_RX_STATUS_Msk)
/** \} */

#define IS_IR_FLAG(FLAG)                (((FLAG) == IR_FLAG_TF_EMPTY) || ((FLAG) == IR_FLAG_TF_FULL) || \
                                         ((FLAG) == IR_FLAG_TX_RUN) || ((FLAG) == IR_FLAG_RF_EMPTY) || \
                                         ((FLAG) == IR_FLAG_RX_RUN))
/**
 * \enum        IR_Compensation_Flag IR Compensation Flag
 * \ingroup     IR_Exported_Constants
 */
typedef enum
{
    IR_COMPEN_FLAG_1_2_CARRIER = ((uint32_t)(1 << IR_LOW_PERIOD_COMPENSATION_Pos)),
    IR_COMPEN_FLAG_1_4_CARRIER = ((uint32_t)(2 << IR_LOW_PERIOD_COMPENSATION_Pos)),
    IR_COMPEN_FLAG_1_N_SYSTEM_CLK = ((uint32_t)(3 << IR_LOW_PERIOD_COMPENSATION_Pos)),
} IR_TX_COMPEN_TYPE;


/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    IR_Exported_Functions   Peripheral APIs
 * \{
 * \ingroup     IR
 */

/**
 * \brief  Deinitializes the IR peripheral registers to their default values.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     IR_DeInit();
 * }
 * \endcode
 */
void IR_DeInit(void);

/**
 * \brief   Initializes the IR peripheral according to the specified
 *          parameters in IR_InitStruct.
 * \param[in] IR_InitStruct: Pointer to a IR_InitTypeDef structure that
 *            contains the configuration information for the specified IR peripheral.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);

 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);

 *     IR_InitStruct.IR_Freq               = 38000;// IR carrier freqency is 38KHz
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;// IR receiveing mode
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     =
         IR_RX_FIFO_THR_LEVEL; // Configure RX FIFO threshold level to trigger IR_INT_RF_LEVEL interrupt
 *     IR_InitStruct.IR_RxFIFOFullCtrl     =
 *         IR_RX_FIFO_FULL_DISCARD_NEWEST;// Discard the lastest received dta if RX FIFO is full
 *     IR_InitStruct.IR_RxFilterTime       =
        IR_RX_FILTER_TIME_50ns;// If high to low or low to high transition time <= 50ns,Filter out it.
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;// Configure trigger type
 *     IR_InitStruct.IR_RxCntThrType       =
        IR_RX_Count_High_Level;// IR_RX_Count_High_Level is counting high level
 *     IR_InitStruct.IR_RxCntThr           =
        0x1F40;// Configure RX counter threshold.You can use it to decide to stop receiving IR data
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_Init(IR_InitTypeDef *IR_InitStruct);

/**
 * \brief  Fills each IR_InitStruct member with its default value.
 * \param[in] IR_InitStruct: Pointer to an IR_InitTypeDef structure which will be initialized.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);

 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);

 *     IR_InitStruct.IR_Freq               = 38000;// IR carrier freqency is 38KHz
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;// IR receiveing mode
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     =
         IR_RX_FIFO_THR_LEVEL; // Configure RX FIFO threshold level to trigger IR_INT_RF_LEVEL interrupt
 *     IR_InitStruct.IR_RxFIFOFullCtrl     =
 *         IR_RX_FIFO_FULL_DISCARD_NEWEST;// Discard the lastest received dta if RX FIFO is full
 *     IR_InitStruct.IR_RxFilterTime       =
        IR_RX_FILTER_TIME_50ns;// If high to low or low to high transition time <= 50ns,Filter out it.
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;// Configure trigger type
 *     IR_InitStruct.IR_RxCntThrType       =
        IR_RX_Count_High_Level;// IR_RX_Count_High_Level is counting high level
 *     IR_InitStruct.IR_RxCntThr           =
        0x1F40;// Configure RX counter threshold.You can use it to decide to stop receiving IR data
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_StructInit(IR_InitTypeDef *IR_InitStruct);

/**
 * \brief   Enable or disable the selected IR mode.
 * \param[in] mode: Selected IR operation mode.
 *      This parameter can be one of the following values:
 *      \arg IR_MODE_TX: Transmission mode.
 *      \arg IR_MODE_RX: Receiving mode.
 * \param[in] NewState: New state of the operation mode.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_ir_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_IR, APBPeriph_IR_CLOCK, ENABLE);

 *     IR_InitTypeDef IR_InitStruct;
 *     IR_StructInit(&IR_InitStruct);

 *     IR_InitStruct.IR_Freq               = 38000;// IR carrier freqency is 38KHz
 *     IR_InitStruct.IR_Mode               = IR_MODE_RX;// IR receiveing mode
 *     IR_InitStruct.IR_RxStartMode        = IR_RX_AUTO_MODE;
 *     IR_InitStruct.IR_RxFIFOThrLevel     =
         IR_RX_FIFO_THR_LEVEL; // Configure RX FIFO threshold level to trigger IR_INT_RF_LEVEL interrupt
 *     IR_InitStruct.IR_RxFIFOFullCtrl     =
 *         IR_RX_FIFO_FULL_DISCARD_NEWEST;// Discard the lastest received dta if RX FIFO is full
 *     IR_InitStruct.IR_RxFilterTime       =
        IR_RX_FILTER_TIME_50ns;// If high to low or low to high transition time <= 50ns,Filter out it.
 *     IR_InitStruct.IR_RxTriggerMode      = IR_RX_FALL_EDGE;// Configure trigger type
 *     IR_InitStruct.IR_RxCntThrType       =
        IR_RX_Count_High_Level;// IR_RX_Count_High_Level is counting high level
 *     IR_InitStruct.IR_RxCntThr           =
        0x1F40;// Configure RX counter threshold.You can use it to decide to stop receiving IR data
 *     IR_Init(&IR_InitStruct);
 *     IR_Cmd(IR_MODE_RX, ENABLE);
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
void IR_Cmd(uint32_t mode, FunctionalState NewState);

/**
 * \brief   Start trigger receive, only in manual receive mode.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_StartManualRxTrigger();
 * }
 * \endcode
 */
void IR_StartManualRxTrigger(void);

/**
 * \brief   Config counter threshold value in receiving mode.You can use it to stop receiving IR data.
 * \param[in] IR_RxCntThrType: Count threshold type.
 *      This parameter can be the following values:
 *      \arg IR_RX_Count_Low_Level: Low level counter value >= IR_RxCntThr, trigger IR_INT_RX_CNT_THR interrupt.
 *      \arg IR_RX_Count_High_Level: High level counter value >= IR_RxCntThr, trigger IR_INT_RX_CNT_THR interrupt.
 * \param[in] IR_RxCntThr: Configure IR Rx counter threshold value which can be 0 to 0x7fffffffUL.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetRxCounterThreshold(IR_RX_Count_Low_Level, 0x100);
 * }
 * \endcode
 */
void IR_SetRxCounterThreshold(uint32_t IR_RxCntThrType, uint32_t IR_RxCntThr);

/**
 * \brief   Send data.
 * \param[in] pBuf: Data buffer to send.
 * \param[in] len: Send data length.
 * \param[in] IsLastPacket: Is it the last package of data.
 *      This parameter can be one of the following values:
 *      \arg ENABLE: The last data in IR packet and there is no continous data.In other words, an infrared data transmission is completed.
 *      \arg DISABLE: There is data to be transmitted continuously.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_SendBuf(data_buf, 68, DISABLE);
 * }
 * \endcode
 */
void IR_SendBuf(uint32_t *pBuf, uint32_t len, FunctionalState IsLastPacket);

/**
 * \brief  Send compensation data.
 * \param[in] comp_type: Compensation data type.
 *      This parameter can be one of the following values:
 *     \arg IR_COMPEN_FLAG_1_2_CARRIER: 1/2 carrier freqency.
 *     \arg IR_COMPEN_FLAG_1_4_CARRIER: 1/4 carrier freqency.
 *     \arg IR_COMPEN_FLAG_1_N_SYSTEM_CLK: MOD((0x48[27:16]+0x00[11:0]), 4095)/40MHz.
            User can call function of IR_ConfigCompParam to configure 0x48[27:16].
 * \param[in] buf: Data buffer to send.
 * \param[in] length: Data length.
 * \param[in] IsLastPacket: Is it the last package of data.
 *      This parameter can be the following values:
 *     \arg ENABLE: The last data in IR packet and there is no continous data.In other words, an infrared data transmission is completed.
 *     \arg DISABLE: There is data to be transmitted continuously.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_SendCompenBuf(IR_COMPEN_FLAG_1_2_CARRIER, data_buf, 68, DISABLE);
 * }
 * \endcode
 */
void IR_SendCompenBuf(IR_TX_COMPEN_TYPE comp_type, uint32_t *pBuf, uint32_t len,
                      FunctionalState IsLastPacket);

/**
 * \brief   Read data From RX FIO.
 * \param[in] pBuf: Buffer address to receive data.
 * \param[in] length: Read data length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data_buf[80] = {0};
 *     IR_ReceiveBuf(data_buf, 68);
 * }
 * \endcode
 */
void IR_ReceiveBuf(uint32_t *pBuf, uint32_t length);

/**
 * \brief   Enables or disables the specified IR interrupt source.
 * \param[in] IR_INT: Specifies the IR interrupt source to be enabled or disabled.
 *      This parameter can be oen of the following values:
 *     \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt source.
 *     \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt source.
 *     \arg IR_INT_TF_OF: TX FIFO overflow interrupt source.
 *     \arg IR_INT_RF_FULL: RX FIFO  full interrupt source.
 *     \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt source.
 *     \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt source.
 *     \arg IR_INT_RF_OF: RX FIFO overflow interrupt source.
 *     \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt source.
 *     \arg IR_INT_RF_ERROR: RX FIFO error read interrupt source. Trigger when RX FIFO empty and read RX FIFO.
 * \param[in]  newState: New state of the specified IR interrupt.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_INTConfig(IR_INT_TF_EMPTY, ENABLE);
 * }
 * \endcode
 */
void IR_INTConfig(uint32_t IR_INT, FunctionalState newState);

/**
 * \brief  Mask or unmask the specified IR interrupt source.
 * \param[in] IR_INT: Specifies the IR interrupts sources to be mask or unmask.
 *      This parameter can be the following values:
 *      \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt.
 *      \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt.
 *      \arg IR_INT_TF_OF: TX FIFO overflow interrupt.
 *      \arg IR_INT_RF_FULL: RX FIFO  full interrupt.
 *      \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt.
 *      \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt.
 *      \arg IR_INT_RF_OF: RX FIFO overflow interrupt.
 *      \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt.
 *      \arg IR_INT_RF_ERROR: RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 * \param[in] newState: New state of the specified IR interrupts.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_MaskINTConfig(IR_INT_TF_EMPTY, ENABLE);
 * }
 * \endcode
 */
void IR_MaskINTConfig(uint32_t IR_INT, FunctionalState newState);

/**
 * \brief Get the specified IR interrupt status.
 * \param[in] IR_INT: the specified IR interrupts.
 *      This parameter can be one of the following values:
 *      \arg IR_INT_TF_EMPTY: TX FIFO empty interrupt.
 *      \arg IR_INT_TF_LEVEL: TX FIFO threshold interrupt.
 *      \arg IR_INT_TF_OF: TX FIFO overflow interrupt.
 *      \arg IR_INT_RF_FULL: RX FIFO  full interrupt.
 *      \arg IR_INT_RF_LEVEL: RX FIFO threshold interrupt.
 *      \arg IR_INT_RX_CNT_OF: RX counter overflow interrupt.
 *      \arg IR_INT_RF_OF: RX FIFO overflow interrupt.
 *      \arg IR_INT_RX_CNT_THR: RX counter threshold interrupt.
 *      \arg IR_INT_RF_ERROR: RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 * \return  The new state of IR_INT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     ITStatus int_status = IR_GetINTStatus(IR_INT_TF_EMPTY);
 * }
 * \endcode
 */
ITStatus IR_GetINTStatus(uint32_t IR_INT);

/**
 * \brief  Clear the IR interrupt pending bit.
 * \param[in]  IR_CLEAR_INT: specifies the interrupt pending bit to clear.
 *      This parameter can be any combination of the following values:
 *      \arg IR_INT_TF_EMPTY_CLR: Clear TX FIFO empty interrupt.
 *      \arg IR_INT_TF_LEVEL_CLR: Clear TX FIFO threshold interrupt.
 *      \arg IR_INT_TF_OF_CLR: Clear TX FIFO overflow interrupt.
 *      \arg IR_INT_RF_FULL_CLR: Clear RX FIFO  full interrupt.
 *      \arg IR_INT_RF_LEVEL_CLR: Clear RX FIFO threshold interrupt.
 *      \arg IR_INT_RX_CNT_OF_CLR: Clear RX counter overflow interrupt.
 *      \arg IR_INT_RF_OF_CLR: Clear RX FIFO overflow interrupt.
 *      \arg IR_INT_RX_CNT_THR_CLR: Clear RX counter threshold interrupt.
 *      \arg IR_INT_RF_ERROR_CLR: Clear RX FIFO error read interrupt. Trigger when RX FIFO empty and read RX FIFO.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearINTPendingBit(IR_INT_RX_CNT_OF_CLR);
 * }
 * \endcode
 */
void IR_ClearINTPendingBit(uint32_t IR_CLEAR_INT);

/**
 * \brief  Get free size of TX FIFO.
 * \param  None.
 * \return The free size of TX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint16_t data_len = IR_GetTxFIFOFreeLen();
 * }
 * \endcode
 */
__STATIC_INLINE uint16_t IR_GetTxFIFOFreeLen(void)
{
    return (uint16_t)(IR_TX_FIFO_SIZE - ((IR->TX_SR & (IR_TX_FIFO_OFFSET_Msk)) >>
                                         IR_TX_FIFO_OFFSET_Pos));
}

/**
 * \brief   Get data size in RX FIFO.
 * \param   None.
 * \return  Current data size in RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint16_t data_len = IR_GetRxDataLen();
 * }
 * \endcode
 */
__STATIC_INLINE uint16_t IR_GetRxDataLen(void)
{
    return ((uint16_t)(((IR->RX_SR) & IR_RX_FIFO_OFFSET_Msk) >> IR_RX_FIFO_OFFSET_Pos));
}

/**
 * \brief   Send one data.
 * \param[in] data: Send data.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SendData(0x80000100);
 * }
 * \endcode
 */
__STATIC_INLINE void IR_SendData(uint32_t data)
{
    IR->TX_FIFO = data;
}

/**
 * \brief   Read one data.
 * \param   None.
 * \return  Data which read from RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     uint32_t data = IR_ReceiveData(30);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IR_ReceiveData(void)
{
    return IR->RX_FIFO;
}

/**
 * \brief  Set tx threshold, when TX FIFO depth <= threshold value trigger interrupt.
 * \param[in] thd: Tx threshold.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetTxThreshold(30);
 * }
 * \endcode
 */
__STATIC_INLINE void IR_SetTxThreshold(uint8_t thd)
{
    IR->TX_CONFIG &= IR_TX_FIFO_THRESHOLD_CLR;
    IR->TX_CONFIG |= (thd << IR_TX_FIFO_THRESHOLD_Pos);
}

/**
 * \brief   Set tx threshold, when RX FIFO depth >= threshold value trigger interrupt.
 * \param[in] thd: Rx threshold.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetRxThreshold(2);
 * }
 * \endcode
 */
__STATIC_INLINE void IR_SetRxThreshold(uint8_t thd)
{
    IR->RX_CONFIG &= IR_RX_FIFO_LEVEL_CLR;
    IR->RX_CONFIG |= (thd << IR_RX_FIFO_LEVEL_Pos);
}

/**
 * \brief  Clear IR TX FIFO.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearTxFIFO();
 * }
 * \endcode
 */
__STATIC_INLINE void IR_ClearTxFIFO(void)
{
    IR->TX_INT_CLR = IR_TX_FIFO_CLR_Msk;
}

/**
 * \brief   Clear IR RX FIFO.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_ClearRxFIFO();
 * }
 * \endcode
 */
__STATIC_INLINE void IR_ClearRxFIFO(void)
{
    IR->RX_INT_CLR = IR_RX_FIFO_CLR_Msk;
}

/**
 * \brief  Check whether the specified IR flag is set.
 * \param[in]  IR_FLAG: Specifies the flag to check.
 *      This parameter can be one of the following values:
 *      \arg IR_FLAG_TF_EMPTY: TX FIFO empty or not. If SET, TX FIFO is empty.
 *      \arg IR_FLAG_TF_FULL: TX FIFO full or not. If SET, TX FIFO is full.
 *      \arg IR_FLAG_TX_RUN: TX run or not. If SET, TX is running.
 *      \arg IR_FLAG_RF_EMPTY: RX FIFO empty or not. If SET, RX FIFO is empty.
 *      \arg IR_FLAG_RX_RUN: RX run or not. If SET, RX is running.
 * \return  The new state of IR_FLAG (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     FlagStatus flag_status = IR_GetFlagStatus(IR_FLAG_TF_EMPTY);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus IR_GetFlagStatus(uint32_t IR_FLAG)
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param(IS_IR_FLAG(IR_FLAG));

    if (IR->TX_CONFIG & IR_MODE_SEL_Msk)
    {
        if (IR->RX_SR & IR_FLAG)
        {
            bitstatus = SET;
        }
        return bitstatus;
    }
    else
    {
        if (IR->TX_SR & IR_FLAG)
        {
            bitstatus = SET;
        }
        return bitstatus;
    }
}

/**
 * \brief   Set or reset tx data inverse.
 * \param[in] NewState: This parameter can be: ENABLE or DISABLE.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_SetTxInverse(ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void IR_SetTxInverse(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE)
    {
        IR->TX_CONFIG |= IR_FIFO_INVERSE_Msk;
    }
    else
    {
        IR->TX_CONFIG &= IR_FIFO_INVERSE_CLR;
    }
}

/**
 * \brief  Enbale TX output inverse or not.
 * \param[in] NewState: This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void ir_demo(void)
 * {
 *     IR_TxOutputInverse(ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void IR_TxOutputInverse(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE)
    {
        IR->TX_CONFIG |= IR_OUTPUT_INVERSE_Msk;
    }
    else
    {
        IR->TX_CONFIG &= IR_OUTPUT_INVERSE_CLR;
    }
}

/** \} */ /* End of group IR_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876x_IR_H_ */



/******************* (C) COPYRIGHT 2019 Realtek Semiconductor Corporation *****END OF FILE****/

